// ms_color_data.js

// 境界線（デコボコ）の型枠データ
export const principalBounds = [
    [2, 4, 8, 14, 14, 14, 10, 8, 4],   // 0: 5R
    [2, 4, 6, 10, 12, 14, 12, 10, 6],  // 1: 5YR
    [2, 4, 4, 6, 8, 10, 12, 14, 10],   // 2: 5Y
    [2, 4, 6, 8, 10, 12, 12, 12, 6],   // 3: 5GY
    [2, 4, 6, 8, 10, 10, 10, 8, 4],    // 4: 5G
    [2, 4, 6, 8, 8, 10, 8, 6, 4],      // 5: 5BG
    [2, 4, 6, 8, 8, 8, 8, 6, 4],       // 6: 5B
    [2, 6, 12, 12, 10, 8, 8, 6, 4],    // 7: 5PB
    [2, 6, 12, 12, 12, 12, 10, 6, 4],  // 8: 5P
    [2, 4, 10, 12, 14, 14, 12, 8, 4]   // 9: 5RP
];

// 無彩色（N）の明度に対するHEXカラーマスタ
export const neutralHexLut = { 
    1: "#1f1f1f", 2: "#323232", 3: "#484848", 4: "#5e5e5e", 5: "#767676", 
    6: "#8f8f8f", 7: "#a9a9a9", 8: "#c4c4c4", 9: "#e0e0e0" 
};

// 40色相マスタ動的生成用のプレフィックスとステップ
export const huePrefixes = ["R", "YR", "Y", "GY", "G", "BG", "B", "PB", "P", "RP"];
export const hueSteps = [2.5, 5, 7.5, 10];